{
    "cs": {
        "base": {
            "name": "Jméno",
            "user_name": "Uživatelské jméno",
            "submit": "Odeslat",
            "back": "Zpět",
            "actions": "Akce",
            "edit": "Upravit",
            "delete": "Smazat",
            "confirm": "Jste si jisti?",
            "password": "Heslo",
            "remember_me": "Pamatuj si mě",
            "log_in": "Přihlásit se",
            "log_out": "Odhlásit se",
            "save": "Uložit",
            "saved": "Uloženo",
            "cancel": "Zrušit"
        },
        "nav": {
            "login": "Přihlášení",
            "register": "Registrace",
            "dashboard": "Přehled",
            "medicine": "Léky",
            "blood_sugar_reading": "Měření",
            "logout": "Odhlášení",
            "profile": "Profil",
            "theme": {
                "light": "Světlý",
                "dark": "Tmavý",
                "system": "Systémový"
            }
        },
        "facts": [
            "10 Fascinujících faktů o diabetu, které byste měli znát",
            "Diabetes je celosvětově rozšířené onemocnění: Diabetes postihuje přibližně 463 milionů lidí po celém světě a tento počet se očekává, že v příštích letech ještě vzroste.",
            "Typ 1 versus Typ 2: Existují dva hlavní typy diabetu. Typ 1 je autoimunitní onemocnění, při kterém tělo přestává produkovat inzulin. Naopak Typ 2 je způsoben nedostatečným účinkem inzulinu nebo jeho nedostatkem.",
            "Diabetem trpí i zvířata: Diabetes není omezen pouze na lidi. Také psi, kočky a dokonce i koně mohou být postiženi touto chorobou.",
            "Genetické predispozice: Máte vyšší riziko vzniku diabetu, pokud máte blízkého příbuzného (rodiče nebo sourozence), který trpí touto chorobou. Genetika hraje důležitou roli v rozvoji diabetu.",
            "Inzulín nevyléčí diabetes: Inzulín je klíčový při léčbě diabetu, ale neexistuje zatím žádný lék, který by tuto nemoc úplně vyléčil. Pacienti s diabetem musí pravidelně kontrolovat hladinu cukru v krvi a užívat inzulín či jiné léky.",
            "Komplikace diabetu: Nesprávně řízený diabetes může způsobovat různé komplikace, jako jsou problémy s očima, ledvinami, srdcem, cévami a nervovým systémem. Pravidelná péče a dodržování zdravého životního stylu je proto klíčová.",
            "Diabetes a obezita: Obezita je jedním z hlavních rizikových faktorů pro rozvoj diabetu Typu 2. Udržování zdravé tělesné hmotnosti a aktivní životní styl jsou proto důležité při prevenci této formy diabetu.",
            "Glykemický index: Glykemický index (GI) je ukazatel, který měří, jak rychle se sacharidy obsažené ve stravě mění na glukózu v krvi. Diabetici se často řídí potravinami s nízkým GI, aby udrželi stabilní hladinu cukru v krvi.",
            "Diabetes a sport: Fyzická aktivita má pro diabetiky mnoho výhod. Pomáhá snižovat hladinu cukru v krvi, zlepšuje citlivost na inzulín a přispívá k celkovému zdraví a pohodě.",
            "Prevence diabetu: Životní styl hraje důležitou roli v prevenci diabetu Typu 2. Dodržování zdravé stravy, pravidelná fyzická aktivita a udržování zdravé tělesné hmotnosti jsou klíčové faktory pro snížení rizika vzniku diabetu."
        ],
        "grid": {
            "per_page": "Záznamů na stránku",
            "showing": "Zobrazuji",
            "of": "až",
            "total": "celkem",
            "from": "z",
            "previous": "Předchozí",
            "next": "Další"
        },
        "medicine": {
            "new": "Nový lék",
            "edit": "Editace léku"
        },
        "blood_sugar_reading": {
            "new": "Nové měření",
            "edit": "Editace měření",
            "date": "Datum",
            "before_breakfast": "Před snídaní",
            "after_breakfast": "Po snídaní",
            "before_lunch": "Před obědem",
            "after_lunch": "Po obědě",
            "before_dinner": "Před večeří",
            "after_dinner": "Po večeři"
        },
        "dashboard": {
            "no_data_found": "Nebyla nalezena žádná data!",
            "widgets": {
                "high_low_readings": {
                    "title": "Minima a maxima",
                    "low": "Nejnižší hodnota",
                    "high": "Nejvyšší hodnota"
                },
                "graph": "posledních 7 hodnot měření"
            }
        },
        "profile": {
            "information": {
                "title": "Informace o profilu",
                "description": "Aktualizujte informace o vašem účtu a emailovou adresu.",
                "verified": {
                    "message": "Vaše emailová adresa není ověřena.",
                    "link": "Klikněte zde pro opětovné zaslání ověřovacího emailu.",
                    "link_sent": "Na vaši emailovou adresu byl odeslán nový ověřovací odkaz."
                }
            },
            "update_password": {
                "title": "Aktualizovat heslo",
                "description": "Zajistěte, aby váš účet používal dlouhé a náhodné heslo pro zajištění bezpečnosti.",
                "current_password": "Současné heslo",
                "new_password": "Nové heslo",
                "confirm_password": "Potvrďte heslo"
            },
            "delete_user": {
                "title": "Smazat účet",
                "description": "Po smazání účtu budou všechny jeho prostředky a data trvale smazány. Před smazáním účtu si prosím stáhněte\n jakákoliv data nebo informace, které si přejete zachovat.",
                "delete_account": "Smazat účet",
                "are_you_sure": "Jste si jisti, že chcete smazat svůj účet?",
                "warning_notice": "Po smazání účtu budou všechny jeho prostředky a data trvale smazány. Prosím,\n zadejte své heslo pro potvrzení, že chcete svůj účet trvale smazat."
            }
        },
        "auth": {
            "email_verification": {
                "title": "Ověření emailu",
                "description": "Děkujeme za registraci! Před začátkem prosím ověřte svou emailovou adresu kliknutím na odkaz,\n který jsme vám právě zaslali emailem. Pokud jste email neobdrželi, rádi vám pošleme další.",
                "link_sent": "Na emailovou adresu, kterou jste uvedli při registraci, byl odeslán nový ověřovací odkaz.",
                "resend": "Znovu zaslat ověřovací email"
            },
            "reset_password": {
                "title": "Obnovení hesla"
            },
            "forgot_password": {
                "title": "Zapomněli jste heslo",
                "description": "Zapomněli jste heslo? Není problém. Dejte nám vědět vaši emailovou adresu a my vám zašleme odkaz na obnovení hesla,\n který vám umožní vybrat si nové heslo.",
                "question": "Zapomněli jste heslo?",
                "reset_link": "Poslat odkaz na obnovení hesla emailem"
            },
            "register": {
                "title": "Registrace",
                "confirm": "Potvrďte heslo",
                "already_registered": "Již jste registrováni?"
            }
        }
    },
    "en": {
        "base": {
            "name": "Name",
            "user_name": "User name",
            "submit": "Submit",
            "back": "Back",
            "actions": "Actions",
            "edit": "Edit",
            "delete": "Delete",
            "confirm": "Are you sure?",
            "password": "Password",
            "remember_me": "Remember me",
            "log_in": "Log in",
            "log_out": "Log out",
            "save": "Save",
            "saved": "Saved",
            "cancel": "Cancel"
        },
        "nav": {
            "login": "Login",
            "register": "Register",
            "dashboard": "Dashboard",
            "medicine": "Medicine",
            "blood_sugar_reading": "Readings",
            "logout": "Logout",
            "profile": "Profile",
            "theme": {
                "light": "Light",
                "dark": "Dark",
                "system": "System"
            }
        },
        "facts": [
            "10 Fascinating Facts About Diabetes You Should Know",
            "Diabetes is a worldwide prevalent disease: Diabetes affects approximately 463 million people worldwide, and this number is expected to increase in the coming years.",
            "Type 1 versus Type 2: There are two main types of diabetes. Type 1 is an autoimmune disease in which the body stops producing insulin, while Type 2 is characterized by insufficient insulin production or its ineffective use.",
            "Animals can also have diabetes: Diabetes is not limited to humans. Dogs, cats, and even horses can be affected by this disease.",
            "Genetic predisposition: You have a higher risk of developing diabetes if you have a close relative (parent or sibling) who has the condition. Genetics play an important role in the development of diabetes.",
            "Insulin does not cure diabetes: Insulin is crucial in the treatment of diabetes, but there is currently no cure that completely eradicates the disease. People with diabetes must regularly monitor their blood sugar levels and take insulin or other medications.",
            "Complications of diabetes: Poorly managed diabetes can lead to various complications, such as eye problems, kidney issues, heart diseases, vascular problems, and nerve damage. Regular care and adherence to a healthy lifestyle are crucial.",
            "Diabetes and obesity: Obesity is one of the major risk factors for developing Type 2 diabetes. Maintaining a healthy body weight and an active lifestyle are important in preventing this form of diabetes.",
            "Glycemic index: The glycemic index (GI) is a measure that indicates how quickly the carbohydrates in food are converted into glucose in the blood. Diabetics often follow low-GI foods to maintain stable blood sugar levels.",
            "Diabetes and exercise: Physical activity has numerous benefits for individuals with diabetes. It helps to lower blood sugar levels, improves insulin sensitivity, and contributes to overall health and well-being.",
            "Diabetes prevention: Lifestyle plays a crucial role in preventing Type 2 diabetes. Adopting a healthy diet, engaging in regular physical activity, and maintaining a healthy body weight are key factors in reducing the risk of developing diabetes."
        ],
        "grid": {
            "per_page": "Records per page",
            "showing": "Showing",
            "of": "of",
            "total": "total",
            "from": "from",
            "previous": "Previous",
            "next": "Next"
        },
        "medicine": {
            "new": "New medicine",
            "edit": "Edit medicine"
        },
        "blood_sugar_reading": {
            "new": "New reading",
            "edit": "Edit reading",
            "date": "Date",
            "before_breakfast": "Before breakfast",
            "after_breakfast": "After breakfast",
            "before_lunch": "Before lunch",
            "after_lunch": "After lunch",
            "before_dinner": "Before dinner",
            "after_dinner": "After dinner"
        },
        "dashboard": {
            "no_data_found": "No data found !",
            "widgets": {
                "high_low_readings": {
                    "title": "High and Low readings",
                    "low": "Lowest value",
                    "high": "Highest value"
                },
                "graph": "last 7 blood sugar readings"
            }
        },
        "profile": {
            "information": {
                "title": "Profile information",
                "description": "Update your account's profile information and email address.",
                "verified": {
                    "message": "Your email address is unverified.",
                    "link": "Click here to re-send the verification email.",
                    "link_sent": "A new verification link has been sent to your email address."
                }
            },
            "update_password": {
                "title": "Update Password",
                "description": "Ensure your account is using a long, random password to stay secure.",
                "current_password": "Current Password",
                "new_password": "New Password",
                "confirm_password": "Confirm Password"
            },
            "delete_user": {
                "title": "Delete Account",
                "description": "Once your account is deleted, all of its resources and data will be permanently deleted. Before deleting\n your account, please download any data or information that you wish to retain.",
                "delete_account": "Delete Account",
                "are_you_sure": "Are you sure you want to delete your account?",
                "warning_notice": "Once your account is deleted, all of its resources and data will be permanently deleted. Please\n enter your password to confirm you would like to permanently delete your account."
            }
        },
        "auth": {
            "email_verification": {
                "title": "Email Verification",
                "description": "Thanks for signing up! Before getting started, could you verify your email address by clicking on the link\n we just emailed to you? If you didn't receive the email, we will gladly send you another.",
                "link_sent": "A new verification link has been sent to the email address you provided during registration.",
                "resend": "Resend Verification Email"
            },
            "reset_password": {
                "title": "Reset Password"
            },
            "forgot_password": {
                "title": "Forgot Password",
                "description": "Forgot your password? No problem. Just let us know your email address and we will email you a password reset\n link that will allow you to choose a new one.",
                "question": "Forgot your password?",
                "reset_link": "Email password reset link"
            },
            "register": {
                "title": "Register",
                "confirm": "Confirm Password",
                "already_registered": "Already registered?"
            }
        }
    }
}
